tap "eth-p/software"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "koekeishiya/formulae"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Isolated development environments using Docker
brew "docker-compose"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Core application library for C
brew "glib"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Pager program similar to more
brew "less"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Theme for zsh
brew "powerlevel10k"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# File browser
brew "ranger"
# Persistent key-value database, with built-in net interface
brew "redis"
# HTTP regression testing and benchmarking utility
brew "siege"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Screen capturing tool
cask "cleanshot"
# App to build and share containerized applications and microservices
cask "docker"
# Developer targeted fonts with a high number of glyphs
cask "font-anonymice-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Superfamily of fonts for code
cask "font-monaspace"
# Utility to hide menu bar items
cask "hiddenbar"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Visual diff and merge tool
cask "meld"
# Control your tools with a few keystrokes
cask "raycast"
# Email client
cask "readdle-spark"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
vscode "Angular.ng-template"
vscode "antfu.file-nesting"
vscode "BeardedBear.beardedicons"
vscode "BeardedBear.beardedtheme"
vscode "benjaminbenais.copilot-theme"
vscode "cdonohue.quill-icons"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "EliverLara.sweet-vscode-icons"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "Gruntfuggly.todo-tree"
vscode "jasonnutter.vscode-codeowners"
vscode "johnpapa.Angular2"
vscode "Orta.vscode-jest"
vscode "prazdevs.zarp-icons"
vscode "Prisma.prisma"
vscode "PulkitGangwar.nextjs-snippets"
vscode "sdras.fortnite-vscode-theme"
vscode "sdras.night-owl"
vscode "sldobri.bunker"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "tamj0rd2.ts-quickfixes-extension"
vscode "unifiedjs.vscode-mdx"
vscode "vintharas.learn-vim"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wesbos.theme-cobalt2"
