tap "eth-p/software"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Isolated development environments using Docker
brew "docker-compose"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# OpenType text shaping engine
brew "harfbuzz"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Platform built on V8 to build network applications
brew "node"
# Interactive environments for writing and running code
brew "jupyterlab"
# Handy way to save and run project-specific commands
brew "just"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Pager program similar to more
brew "less"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Theme for zsh
brew "powerlevel10k"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# File browser
brew "ranger"
# Persistent key-value database, with built-in net interface
brew "redis"
# HTTP regression testing and benchmarking utility
brew "siege"
# Create beautiful image of your source code
brew "silicon"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Screen capturing tool
cask "cleanshot"
# App to build and share containerised applications and microservices
cask "docker"
# Reimagine your terminal
cask "fig"
cask "font-anonymice-nerd-font"
cask "font-cascadia-code"
cask "font-caskaydia-cove-nerd-font"
cask "font-hack-nerd-font"
cask "font-monaspace"
cask "font-mononoki"
cask "font-mononoki-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Utility to hide menu bar items
cask "hiddenbar"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# GPU-based terminal emulator
cask "kitty"
# Extensible two-pane file manager
cask "marta"
# Visual diff and merge tool
cask "meld"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Email client
cask "readdle-spark"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
vscode "angular.ng-template"
vscode "antfu.file-nesting"
vscode "beardedbear.beardedicons"
vscode "beardedbear.beardedtheme"
vscode "benjaminbenais.copilot-theme"
vscode "cdonohue.quill-icons"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "eliverlara.sweet-vscode-icons"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "gruntfuggly.todo-tree"
vscode "jasonnutter.vscode-codeowners"
vscode "johnpapa.angular2"
vscode "orta.vscode-jest"
vscode "prazdevs.zarp-icons"
vscode "prisma.prisma"
vscode "pulkitgangwar.nextjs-snippets"
vscode "sdras.fortnite-vscode-theme"
vscode "sdras.night-owl"
vscode "sldobri.bunker"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "tamj0rd2.ts-quickfixes-extension"
vscode "unifiedjs.vscode-mdx"
vscode "vintharas.learn-vim"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wesbos.theme-cobalt2"
