tap "1password/tap"
tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "jandedobbeleer/oh-my-posh"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Modern replacement for 'ls'
brew "exa"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Core application library for C
brew "glib"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# File browser
brew "ranger"
# Terminal multiplexer
brew "tmux"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application uninstaller
cask "appcleaner"
# Web browser focusing on privacy
cask "brave-browser"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Screen capturing tool
cask "cleanshot"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Reimagine your terminal
cask "fig"
# Developer targeted fonts with a high number of glyphs
cask "font-anonymice-nerd-font"
# Superfamily of fonts for code
cask "font-monaspace"
# GIT client
cask "fork"
# Utility to hide menu bar items
cask "hiddenbar"
# Terminal built on web technologies
cask "hyper"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Visual diff and merge tool
cask "meld"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# App to write, plan, collaborate, and get organized
cask "notion"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# HTTP client that helps testing and describing APIs
cask "paw"
# Control your tools with a few keystrokes
cask "raycast"
# Email client
cask "readdle-spark"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# JavaScript IDE
cask "webstorm"
# Native desktop client for WhatsApp
cask "whatsapp"
mas "1Password for Safari", id: 1569813296
mas "Controller", id: 1198176727
mas "Craft", id: 1487937127
mas "DaisyDisk", id: 411643860
mas "Grammarly for Safari", id: 1462114288
mas "Keynote", id: 409183694
mas "MusicHarbor", id: 1440405750
mas "Notability", id: 360593530
mas "Save to Raindrop.io", id: 1549370672
mas "Slack", id: 803453959
mas "Speediness", id: 1596706466
mas "Things", id: 904280696
mas "Ulysses", id: 1225570693
mas "Vinegar", id: 1591303229
mas "Xcode", id: 497799835
vscode "alexperronnet.spectrum-vscode-icons"
vscode "Angular.ng-template"
vscode "antfu.file-nesting"
vscode "BeardedBear.beardedicons"
vscode "BeardedBear.beardedtheme"
vscode "benjaminbenais.copilot-theme"
vscode "cdonohue.quill-icons"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "EliverLara.sweet-vscode-icons"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "Gruntfuggly.todo-tree"
vscode "jasonnutter.vscode-codeowners"
vscode "johnpapa.Angular2"
vscode "Orta.vscode-jest"
vscode "prazdevs.zarp-icons"
vscode "Prisma.prisma"
vscode "PulkitGangwar.nextjs-snippets"
vscode "sdras.fortnite-vscode-theme"
vscode "sdras.night-owl"
vscode "sldobri.bunker"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "tamj0rd2.ts-quickfixes-extension"
vscode "unifiedjs.vscode-mdx"
vscode "vintharas.learn-vim"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wesbos.theme-cobalt2"
